{
    "projects": [
        {
            "id": 0,
            "project_name": "Rains Ecommerce Brand",
            "thumbnail_description": "A rebuild of the clothing brand, Rains",
            "project_description": "A simplified version of the clothing brand, Rains, gives the experience of a real-world ecommerce website. This project implements components that millions interact with daily such as swatches to select a product's color, photo sliders to cycle through additional images and a cart system to add products and determine an amount to purchase.",
            "live_link": "https://rains-ecommerce-app.netlify.com",
            "image_urls": ["rains-home.png","rains-product-details.png","rains-cart.png"]
        },
        {
            "id": 1,
            "project_name": "Flickr Gallery App",
            "thumbnail_description": "An app to search and generate a gallery of photos using Flickr's API",
            "project_description": "This simple react app returns a list of twenty-four photos from flickr by the user's input. The data returned is filtered by receiving only one photo per user to keep most photos displayed on the page unique. All photos are placed in an eye appealing masonry-like grid. Keeping every functionality concern separated into components makes for easier maintenance and app expansion in the future.",
            "live_link": "https://brave-poincare-eefe40.netlify.com",
            "github_link": "https://github.com/jesusMdza/7-react-gallery-app",
            "image_urls": ["react-app-search.png","react-app-photos.png","react-app-err.png"]
        },
        {
            "id": 2,
            "project_name": "List Pagination & Filtering",
            "thumbnail_description": "Paginated student list with search filter",
            "project_description": "A long list of students displayed on one single page has given a bad experience to users. To solve this problem, pagination and filtering was implemented. Each page within the program displays now ten students at a time. To reduce the time to search for a student, a functional search bar was necessary which processes the user's input and compares this with the data of each student.",
            "live_link": "https://jesusmdza.github.io/2-pagination-and-filtering/",
            "github_link": "https://github.com/jesusMdza/2-pagination-and-filtering",
            "image_urls": ["listpag-page.png","listpag-search.png","listpag-err.png"]
        },
        {
            "id": 3,
            "project_name": "Public API Requests",
            "thumbnail_description": "A simple application that accesses an api to generate and map employee data",
            "project_description": "A program that's designed as a tool for employees to connect with one another. Data for an employee is generated by accessing a free open-source API named 'randomuser'. When a random employee has been processed and returned, the data is transformed into a physical card and appended to the page. Clicking on a card pops up a functional modal which shows more details and gives the user the ability to cycle through other cards on the page. For quick filtering, a search bar filters through the current employees shown.",
            "live_link": "https://jesusmdza.github.io/5-public-api-requests/",
            "github_link": "https://github.com/jesusMdza/5-public-api-requests",
            "image_urls": ["api-main.png","api-modal.png","api-search.png", "api-err.png"]
        },
        {
            "id": 4,
            "project_name": "Interactive Form",
            "thumbnail_description": "A form that processes and validates user data",
            "project_description": "With the power of jQuery comes a functional and engaging 'fill-out' form for a conference event. The user can select job role, t-shirt options, activity workshops and more.",
            "live_link": "https://jesusmdza.github.io/3-interactive-form/",
            "github_link": "https://github.com/jesusMdza/3-interactive-form",
            "image_urls": ["form-main.png","form-activity.png","form-err.png"]
        },
        {
            "id": 5,
            "project_name": "OOP Game Show App",
            "thumbnail_description": "Interactive game which gives you five tries to guess a phrase",
            "project_description": "A 'game show' like application that gives a user five chances to guess from a collection of popular phrases. As a user selects a letter, it compares their value with the values from the random phrase chosen for that current game. Object-Oriented Programming keeps the structure organized by creating objects with their own properties and functions and allows them to interact with one another. ",
            "live_link": "https://jesusmdza.github.io/4-oop-game-show-app/",
            "github_link": "https://github.com/jesusMdza/4-oop-game-show-app",
            "image_urls": ["oop-main.png","oop-game.png","oop-tryagain.png"]
        },
        {
            "id": 6,
            "project_name": "le grain de cafe",
            "thumbnail_description": "A website that promotes a small coffee brand",
            "project_description": "'le grain de cafe' is a pseudo coffee company that wants to spread their message and great coffee to the world.",
            "live_link": "https://jesusmdza.github.io/le-grain-de-cafe/index.html",
            "github_link": "https://github.com/jesusMdza/le-grain-de-cafe",
            "image_urls": ["cafe-main.png","cafe-prod.png","cafe-loc.png","cafe-form.png"]
        },
        {
            "id": 7,
            "project_name": "Static Node and Express Site",
            "thumbnail_description": "A portfolio created with Node.js and the Express Framework",
            "project_description": "Utilizing Node.js, Express and Pug comes a static website of a basic portfolio. PUG allows HTML templates to be rendered dynamically by receiving data from a local JSON file and placing that data within each PUG template with the help of the Express Web Framework.",
            "live_link": "https://jm-static-node-express-site.herokuapp.com/",
            "github_link": "https://github.com/jesusMdza/6-static-node-and-express-site",
            "image_urls": ["exp-main.png", "exp-project.png", "exp-info.png", "exp-error.png"]
        }
    ]
}